[{"tmdbId":299536,"title":"Avengers: Infinity War","overview":"As the Avengers and their allies have continued to protect the world from threats too large for any one hero to handle, a new danger has emerged from the cosmic shadows: Thanos. A despot of intergalactic infamy, his goal is to collect all six Infinity Stones, artifacts of unimaginable power, and use them to inflict his twisted will on all of reality. Everything the Avengers have fought for has led up to this moment - the fate of Earth and existence itself has never been more uncertain.","posterPath":"/7WsyChQLEftFiDOVTGkv3hFpyyt.jpg","genres":["Adventure","Action","Science Fiction"],"releaseDate":"2018-04-25","voteAverage":8.235,"runtime":149,"categories":["Trending"],"streamingUrl":""},{"tmdbId":376812,"title":"Sultan","overview":"The ageing wrestler Sultan Ali Khan decides to try his luck on the mat again; to do this, he wants to represent his country at the Olympic Games, but first has to overcome personal issues.","posterPath":"/vPTYtKuV8X5uUd3SqnzO14W6Dti.jpg","genres":["Drama","Action","Romance"],"releaseDate":"2016-07-06","voteAverage":6.9,"runtime":170,"categories":["Trending"],"streamingUrl":""},{"tmdbId":456565,"title":"Judwaa 2","overview":"Separated at birth and peculiarly connected via their reflexes, twins Prem and Raja are reunited with each other as they set out to take down the underground smuggling world.","posterPath":"/qzlhqiKML1O5lqgqmhVwfEMVui2.jpg","genres":["Action","Comedy","Romance"],"releaseDate":"2017-09-29","voteAverage":5.509,"runtime":150,"categories":["Popular"],"streamingUrl":""},{"tmdbId":238,"title":"The Godfather","overview":"Spanning the years 1945 to 1955, a chronicle of the fictional Italian-American Corleone crime family. When organized crime family patriarch, Vito Corleone barely survives an attempt on his life, his youngest son, Michael steps in to take care of the would-be killers, launching a campaign of bloody revenge.","posterPath":"/3bhkrj58Vtu7enYsRolD1fZdja1.jpg","genres":["Drama","Crime"],"releaseDate":"1972-03-14","voteAverage":8.7,"runtime":175,"categories":["Popular"],"streamingUrl":""},{"tmdbId":986056,"title":"Thunderbolts*","overview":"After finding themselves ensnared in a death trap, seven disillusioned castoffs must embark on a dangerous mission that will force them to confront the darkest corners of their pasts.","posterPath":"/hqcexYHbiTBfDIdDWxrxPtVndBX.jpg","genres":["Action","Science Fiction","Adventure"],"releaseDate":"2025-04-30","voteAverage":7.361,"runtime":127,"categories":["New Releases"],"streamingUrl":""},{"tmdbId":1726,"title":"Iron Man","overview":"After being held captive in an Afghan cave, billionaire engineer Tony Stark creates a unique weaponized suit of armor to fight evil.","posterPath":"/78lPtwv72eTNqFW9COBYI0dWDJa.jpg","genres":["Action","Science Fiction","Adventure"],"releaseDate":"2008-04-30","voteAverage":7.653,"runtime":126,"categories":["New Releases"],"streamingUrl":""},{"tmdbId":1930,"title":"The Amazing Spider-Man","overview":"Peter Parker is an outcast high schooler abandoned by his parents as a boy, leaving him to be raised by his Uncle Ben and Aunt May. Like most teenagers, Peter is trying to figure out who he is and how he got to be the person he is today. As Peter discovers a mysterious briefcase that belonged to his father, he begins a quest to understand his parents' disappearance – leading him directly to Oscorp and the lab of Dr. Curt Connors, his father's former partner. As Spider-Man is set on a collision course with Connors' alter ego, The Lizard, Peter will make life-altering choices to use his powers and shape his destiny to become a hero.","posterPath":"/jexoNYnPd6vVrmygwF6QZmWPFdu.jpg","genres":["Action","Adventure","Science Fiction"],"releaseDate":"2012-06-23","voteAverage":6.721,"runtime":136,"categories":["New Releases"],"streamingUrl":""},{"tmdbId":1311031,"title":"Demon Slayer: Kimetsu no Yaiba Infinity Castle","overview":"The Demon Slayer Corps are drawn into the Infinity Castle, where Tanjiro, Nezuko, and the Hashira face terrifying Upper Rank demons in a desperate fight as the final battle against Muzan Kibutsuji begins.","posterPath":"/aFRDH3P7TX61FVGpaLhKr6QiOC1.jpg","genres":["Animation","Action","Fantasy","Thriller"],"releaseDate":"2025-07-18","voteAverage":7.3,"runtime":155,"categories":[],"streamingUrl":""}]