[{"tmdbId":376812,"title":"Sultan","overview":"The ageing wrestler Sultan Ali Khan decides to try his luck on the mat again; to do this, he wants to represent his country at the Olympic Games, but first has to overcome personal issues.","posterPath":"/vPTYtKuV8X5uUd3SqnzO14W6Dti.jpg","genres":["Drama","Action","Romance"],"releaseDate":"2016-07-06","voteAverage":6.9,"runtime":170,"categories":["Trending"],"streamingUrl":""},{"tmdbId":456565,"title":"Judwaa 2","overview":"Separated at birth and peculiarly connected via their reflexes, twins Prem and Raja are reunited with each other as they set out to take down the underground smuggling world.","posterPath":"/qzlhqiKML1O5lqgqmhVwfEMVui2.jpg","genres":["Action","Comedy","Romance"],"releaseDate":"2017-09-29","voteAverage":5.509,"runtime":150,"categories":["Popular"],"streamingUrl":""},{"tmdbId":238,"title":"The Godfather","overview":"Spanning the years 1945 to 1955, a chronicle of the fictional Italian-American Corleone crime family. When organized crime family patriarch, Vito Corleone barely survives an attempt on his life, his youngest son, Michael steps in to take care of the would-be killers, launching a campaign of bloody revenge.","posterPath":"/3bhkrj58Vtu7enYsRolD1fZdja1.jpg","genres":["Drama","Crime"],"releaseDate":"1972-03-14","voteAverage":8.7,"runtime":175,"categories":["Popular"],"streamingUrl":""},{"tmdbId":986056,"title":"Thunderbolts*","overview":"After finding themselves ensnared in a death trap, seven disillusioned castoffs must embark on a dangerous mission that will force them to confront the darkest corners of their pasts.","posterPath":"/hqcexYHbiTBfDIdDWxrxPtVndBX.jpg","genres":["Action","Science Fiction","Adventure"],"releaseDate":"2025-04-30","voteAverage":7.361,"runtime":127,"categories":["New Releases"],"streamingUrl":""},{"tmdbId":1726,"title":"Iron Man","overview":"After being held captive in an Afghan cave, billionaire engineer Tony Stark creates a unique weaponized suit of armor to fight evil.","posterPath":"/78lPtwv72eTNqFW9COBYI0dWDJa.jpg","genres":["Action","Science Fiction","Adventure"],"releaseDate":"2008-04-30","voteAverage":7.653,"runtime":126,"categories":["New Releases"],"streamingUrl":""},{"tmdbId":1930,"title":"The Amazing Spider-Man","overview":"Peter Parker is an outcast high schooler abandoned by his parents as a boy, leaving him to be raised by his Uncle Ben and Aunt May. Like most teenagers, Peter is trying to figure out who he is and how he got to be the person he is today. As Peter discovers a mysterious briefcase that belonged to his father, he begins a quest to understand his parents' disappearance – leading him directly to Oscorp and the lab of Dr. Curt Connors, his father's former partner. As Spider-Man is set on a collision course with Connors' alter ego, The Lizard, Peter will make life-altering choices to use his powers and shape his destiny to become a hero.","posterPath":"/jexoNYnPd6vVrmygwF6QZmWPFdu.jpg","genres":["Action","Adventure","Science Fiction"],"releaseDate":"2012-06-23","voteAverage":6.721,"runtime":136,"categories":["New Releases"],"streamingUrl":""},{"tmdbId":268,"title":"Batman","overview":"Having witnessed his parents' brutal murder as a child, millionaire philanthropist Bruce Wayne fights crime in Gotham City disguised as Batman, a costumed hero who strikes fear into the hearts of villains. But when a deformed madman known as 'The Joker' seizes control of Gotham's criminal underworld, Batman must face his most ruthless nemesis ever while protecting both his identity and his love interest, reporter Vicki Vale.","posterPath":"/cij4dd21v2Rk2YtUQbV5kW69WB2.jpg","genres":["Fantasy","Action","Crime"],"releaseDate":"1989-06-21","voteAverage":7.234,"runtime":126,"categories":[],"streamingUrl":""},{"tmdbId":1061474,"title":"Superman","overview":"Superman, a journalist in Metropolis, embarks on a journey to reconcile his Kryptonian heritage with his human upbringing as Clark Kent.","posterPath":"/ombsmhYUqR4qqOLOxAyr5V8hbyv.jpg","genres":["Science Fiction","Adventure","Action"],"releaseDate":"2025-07-09","voteAverage":7.5,"runtime":130,"categories":[],"streamingUrl":""},{"tmdbId":1035259,"title":"The Naked Gun","overview":"Only one man has the particular set of skills... to lead Police Squad and save the world: Lt. Frank Drebin Jr.","posterPath":"/aq0JMbmSfPwG8JvAzExJPrBHqmG.jpg","genres":[],"releaseDate":"2025-07-30","voteAverage":6.786,"runtime":0,"categories":["Trending"],"streamingUrl":""},{"tmdbId":1007734,"title":"Nobody 2","overview":"Former assassin Hutch Mansell takes his family on a nostalgic vacation to a small-town theme park, only to be pulled back into violence when they clash with a corrupt operator, a crooked sheriff, and a ruthless crime boss.","posterPath":"/svXVRoRSu6zzFtCzkRsjZS7Lqpd.jpg","genres":[],"releaseDate":"2025-08-13","voteAverage":7.268,"runtime":0,"categories":["Trending"],"streamingUrl":""},{"tmdbId":1038392,"title":"The Conjuring: Last Rites","overview":"Paranormal investigators Ed and Lorraine Warren take on one last terrifying case involving mysterious entities they must confront.","posterPath":"/8XfIKOPmuCZLh5ooK13SPKeybWF.jpg","genres":[],"releaseDate":"2025-09-03","voteAverage":7.0,"runtime":0,"categories":["Trending"],"streamingUrl":""},{"tmdbId":1242434,"title":"Highest 2 Lowest","overview":"When a titan music mogul, widely known as having the \"best ears in the business\", is targeted with a ransom plot, he is jammed up in a life-or-death moral dilemma.","posterPath":"/kOzwIr0R7WhaFgoYUZFLPZA2RBZ.jpg","genres":[],"releaseDate":"2025-08-14","voteAverage":6.202,"runtime":0,"categories":["Trending"],"streamingUrl":""},{"tmdbId":911430,"title":"F1","overview":"Racing legend Sonny Hayes is coaxed out of retirement to lead a struggling Formula 1 team—and mentor a young hotshot driver—while chasing one more chance at glory.","posterPath":"/9PXZIUsSDh4alB80jheWX4fhZmy.jpg","genres":[],"releaseDate":"2025-06-25","voteAverage":7.82,"runtime":0,"categories":["Trending"],"streamingUrl":""},{"tmdbId":1119878,"title":"Ice Road: Vengeance","overview":"Big rig ice road driver Mike McCann travels to Nepal to scatter his late brother’s ashes on Mt. Everest. While on a packed tour bus traversing the deadly 12,000 ft. terrain of the infamous Road to the Sky, McCann and his mountain guide encounter a group of mercenaries and must fight to save themselves, the busload of innocent travelers, and the local villagers’ homeland.","posterPath":"/cQN9rZj06rXMVkk76UF1DfBAico.jpg","genres":[],"releaseDate":"2025-06-27","voteAverage":6.644,"runtime":0,"categories":["Trending"],"streamingUrl":""},{"tmdbId":541671,"title":"Ballerina","overview":"Taking place during the events of John Wick: Chapter 3 – Parabellum, Eve Macarro begins her training in the assassin traditions of the Ruska Roma.","posterPath":"/2VUmvqsHb6cEtdfscEA6fqqVzLg.jpg","genres":[],"releaseDate":"2025-06-04","voteAverage":7.392,"runtime":0,"categories":["Trending"],"streamingUrl":""},{"tmdbId":7451,"title":"xXx","overview":"Xander Cage is your standard adrenaline junkie with no fear and a lousy attitude. When the US Government \"recruits\" him to go on a mission, he's not exactly thrilled. His mission: to gather information on an organization that may just be planning the destruction of the world, led by the nihilistic Yorgi.","posterPath":"/xeEw3eLeSFmJgXZzmF2Efww0q3s.jpg","genres":[],"releaseDate":"2002-08-09","voteAverage":5.959,"runtime":0,"categories":["Trending"],"streamingUrl":""},{"tmdbId":1078605,"title":"Weapons","overview":"When all but one child from the same class mysteriously vanish on the same night at exactly the same time, a community is left questioning who or what is behind their disappearance.","posterPath":"/cpf7vsRZ0MYRQcnLWteD5jK9ymT.jpg","genres":[],"releaseDate":"2025-08-04","voteAverage":7.5,"runtime":0,"categories":["Trending"],"streamingUrl":""},{"tmdbId":1234821,"title":"Jurassic World Rebirth","overview":"Five years after the events of Jurassic World Dominion, covert operations expert Zora Bennett is contracted to lead a skilled team on a top-secret mission to secure genetic material from the world's three most massive dinosaurs. When Zora's operation intersects with a civilian family whose boating expedition was capsized, they all find themselves stranded on an island where they come face-to-face with a sinister, shocking discovery that's been hidden from the world for decades.","posterPath":"/1RICxzeoNCAO5NpcRMIgg1XT6fm.jpg","genres":[],"releaseDate":"2025-07-01","voteAverage":6.379,"runtime":0,"categories":["Trending"],"streamingUrl":""},{"tmdbId":744653,"title":"The Thursday Murder Club","overview":"A group of senior sleuths passionate about solving cold cases get plunged into a real-life murder mystery in this comic crime caper.","posterPath":"/u0o7XtI0WWdLzlK9hVT8lQTB6Yd.jpg","genres":[],"releaseDate":"2025-08-22","voteAverage":6.733,"runtime":0,"categories":["Trending"],"streamingUrl":""},{"tmdbId":803796,"title":"KPop Demon Hunters","overview":"When K-pop superstars Rumi, Mira and Zoey aren't selling out stadiums, they're using their secret powers to protect their fans from supernatural threats.","posterPath":"/22AouvwlhlXbe3nrFcjzL24bvWH.jpg","genres":[],"releaseDate":"2025-06-20","voteAverage":8.358,"runtime":0,"categories":["Trending"],"streamingUrl":""},{"tmdbId":575265,"title":"Mission: Impossible - The Final Reckoning","overview":"Ethan Hunt and team continue their search for the terrifying AI known as the Entity — which has infiltrated intelligence networks all over the globe — with the world's governments and a mysterious ghost from Hunt's past on their trail. Joined by new allies and armed with the means to shut the Entity down for good, Hunt is in a race against time to prevent the world as we know it from changing forever.","posterPath":"/z53D72EAOxGRqdr7KXXWp9dJiDe.jpg","genres":[],"releaseDate":"2025-05-17","voteAverage":7.28,"runtime":0,"categories":["Trending"],"streamingUrl":""},{"tmdbId":138843,"title":"The Conjuring","overview":"Paranormal investigators Ed and Lorraine Warren work to help a family terrorized by a dark presence in their farmhouse. Forced to confront a powerful entity, the Warrens find themselves caught in the most terrifying case of their lives.","posterPath":"/wVYREutTvI2tmxr6ujrHT704wGF.jpg","genres":[],"releaseDate":"2013-07-18","voteAverage":7.54,"runtime":0,"categories":["Trending"],"streamingUrl":""},{"tmdbId":617126,"title":"The Fantastic 4: First Steps","overview":"Against the vibrant backdrop of a 1960s-inspired, retro-futuristic world, Marvel's First Family is forced to balance their roles as heroes with the strength of their family bond, while defending Earth from a ravenous space god called Galactus and his enigmatic Herald, Silver Surfer.","posterPath":"/x26MtUlwtWD26d0G0FXcppxCJio.jpg","genres":[],"releaseDate":"2025-07-23","voteAverage":7.2,"runtime":0,"categories":["Trending"],"streamingUrl":""},{"tmdbId":615457,"title":"Nobody","overview":"Hutch Mansell, a suburban dad, overlooked husband, nothing neighbor — a \"nobody.\" When two thieves break into his home one night, Hutch's unknown long-simmering rage is ignited and propels him on a brutal path that will uncover dark secrets he fought to leave behind.","posterPath":"/oBgWY00bEFeZ9N25wWVyuQddbAo.jpg","genres":[],"releaseDate":"2021-03-18","voteAverage":7.9,"runtime":0,"categories":["Trending"],"streamingUrl":""},{"tmdbId":1175942,"title":"The Bad Guys 2","overview":"The now-reformed Bad Guys are trying (very, very hard) to be good, but instead find themselves hijacked into a high-stakes, globe-trotting heist, masterminded by a new team of criminals they never saw coming: The Bad Girls.","posterPath":"/26oSPnq0ct59l07QOXZKyzsiRtN.jpg","genres":[],"releaseDate":"2025-07-24","voteAverage":7.818,"runtime":0,"categories":["Trending"],"streamingUrl":""}]